# coding=utf-8
#!python3

# =======================================================================
"""
来源：代码清单18-2
问题：Ping 游戏
接口：
说明：
"""
# =======================================================================
# modules section
import sys
import random
import pygame

# =======================================================================
# globals 
# RGB 颜色(colordict.py里面有完整定义)
color_black = [0  ,0  ,0  ]
color_white = [255,255,255]
color_red   = [255,0  ,0  ]
color_green = [0  ,255,0  ]
color_blue  = [0  ,0  ,255]